NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240L022VNF.svd
        <register>
          <name>DALICFG</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00009F3F</resetMask>
          <fields>
            <field>
              <name>DALIEN</name>
              <description>DALI Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DALITXDATABITS</name>
              <description>DALI TX Databits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Each frame contains 8 data bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>Each frame contains 9 data bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN</name>
                  <description>Each frame contains 10 data bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVEN</name>
                  <description>Each frame contains 11 data bits</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <description>Each frame contains 12 data bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEEN</name>
                  <description>Each frame contains 13 data bits</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEEN</name>
                  <description>Each frame contains 14 data bits</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEEN</name>
                  <description>Each frame contains 15 data bits</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>Each frame contains 16 data bits</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVENTEEN</name>
                  <description>Each frame contains 17 data bits</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTEEN</name>
                  <description>Each frame contains 18 data bits</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINETEEN</name>
                  <description>Each frame contains 19 data bits</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTY</name>
                  <description>Each frame contains 20 data bits</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYONE</name>
                  <description>Each frame contains 21 data bits</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYTWO</name>
                  <description>Each frame contains 22 data bits</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYTHREE</name>
                  <description>Each frame contains 23 data bits</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYFOUR</name>
                  <description>Each frame contains 24 data bits</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYFIVE</name>
                  <description>Each frame contains 25 data bits</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYSIX</name>
                  <description>Each frame contains 26 data bits</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYSEVEN</name>
                  <description>Each frame contains 27 data bits</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYEIGHT</name>
                  <description>Each frame contains 28 data bits</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYNINE</name>
                  <description>Each frame contains 29 data bits</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTY</name>
                  <description>Each frame contains 30 data bits</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYONE</name>
                  <description>Each frame contains 31 data bits</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYTWO</name>
                  <description>Each frame contains 32 data bits</description>
                  <value>24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DALIRXDATABITS</name>
              <description>DALI RX Databits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Each frame contains 8 data bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>Each frame contains 9 data bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEN</name>
                  <description>Each frame contains 10 data bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELEVEN</name>
                  <description>Each frame contains 11 data bits</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWELVE</name>
                  <description>Each frame contains 12 data bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEEN</name>
                  <description>Each frame contains 13 data bits</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEEN</name>
                  <description>Each frame contains 14 data bits</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEEN</name>
                  <description>Each frame contains 15 data bits</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>Each frame contains 16 data bits</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVENTEEN</name>
                  <description>Each frame contains 17 data bits</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTEEN</name>
                  <description>Each frame contains 18 data bits</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINETEEN</name>
                  <description>Each frame contains 19 data bits</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTY</name>
                  <description>Each frame contains 20 data bits</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYONE</name>
                  <description>Each frame contains 21 data bits</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYTWO</name>
                  <description>Each frame contains 22 data bits</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYTHREE</name>
                  <description>Each frame contains 23 data bits</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYFOUR</name>
                  <description>Each frame contains 24 data bits</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYFIVE</name>
                  <description>Each frame contains 25 data bits</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYSIX</name>
                  <description>Each frame contains 26 data bits</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYSEVEN</name>
                  <description>Each frame contains 27 data bits</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYEIGHT</name>
                  <description>Each frame contains 28 data bits</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYNINE</name>
                  <description>Each frame contains 29 data bits</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTY</name>
                  <description>Each frame contains 30 data bits</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYONE</name>
                  <description>Each frame contains 31 data bits</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYTWO</name>
                  <description>Each frame contains 32 data bits</description>
                  <value>24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DALIRXENDT</name>
              <description>DALI RX Enabled During Transmission</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
