NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240L022VNF.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_NS</name>
      <version>3</version>
      <description>GPIO_NS Registers</description>
      <baseAddress>0x5003C000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO_ODD</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>GPIO_EVEN</name>
        <value>26</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>ip version id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTA_CTRL</name>
          <description>Port control</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00400040</resetValue>
          <resetMask>0x10701070</resetMask>
          <fields>
            <field>
              <name>SLEWRATE</name>
              <description>Slew Rate</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DINDIS</name>
              <description>Data In Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEWRATEALT</name>
              <description>Slew Rate Alt</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DINDISALT</name>
              <description>Data In Disable Alt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTA_MODEL</name>
          <description>mode low</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE0</name>
              <description>MODE n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled.  Pullup if DOUT is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter.  DOUT determines pull direction.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLALT</name>
                  <description>Push-pull using alternate control.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALT</name>
                  <description>Open-drain output using alternate control.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTFILTER</name>
                  <description>Open-drain output using alternate control with filter.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUP</name>
                  <description>Open-drain output using alternate control with pullup.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUPFILTER</name>
                  <description>Open-drain output using alternate control with filter and pullup.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE1</name>
              <description>MODE n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled.  Pullup if DOUT is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter.  DOUT determines pull direction.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLALT</name>
                  <description>Push-pull using alternate control.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALT</name>
                  <description>Open-drain output using alternate control.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTFILTER</name>
                  <description>Open-drain output using alternate control with filter.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUP</name>
                  <description>Open-drain output using alternate control with pullup.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUPFILTER</name>
                  <description>Open-drain output using alternate control with filter and pullup.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE2</name>
              <description>MODE n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled.  Pullup if DOUT is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter.  DOUT determines pull direction.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLALT</name>
                  <description>Push-pull using alternate control.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALT</name>
                  <description>Open-drain output using alternate control.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTFILTER</name>
                  <description>Open-drain output using alternate control with filter.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUP</name>
                  <description>Open-drain output using alternate control with pullup.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUPFILTER</name>
                  <description>Open-drain output using alternate control with filter and pullup.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE3</name>
              <description>MODE n</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled.  Pullup if DOUT is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter.  DOUT determines pull direction.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLALT</name>
                  <description>Push-pull using alternate control.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALT</name>
                  <description>Open-drain output using alternate control.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTFILTER</name>
                  <description>Open-drain output using alternate control with filter.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUP</name>
                  <description>Open-drain output using alternate control with pullup.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUPFILTER</name>
                  <description>Open-drain output using alternate control with filter and pullup.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE4</name>
              <description>MODE n</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled.  Pullup if DOUT is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter.  DOUT determines pull direction.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLALT</name>
                  <description>Push-pull using alternate control.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALT</name>
                  <description>Open-drain output using alternate control.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTFILTER</name>
                  <description>Open-drain output using alternate control with filter.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUP</name>
                  <description>Open-drain output using alternate control with pullup.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDALTPULLUPFILTER</name>
                  <description>Open-drain output using alternate control with filter and pullup.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE5</name>
              <description>MODE n</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled.  Pullup if DOUT is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
